/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 12:24:26 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 12:24:28 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Функция atoi() конвертирует строку, на которую
указывает параметр str, в величину типа int.
Строка должна содержать корректную запись целого числа
В противном случае возвращается 0.
Число может завершаться любым символом,
который не может входить в состав строкового представления целого числа.
Сюда относятся пробелы, знаки пунктуации 
и другие знаки, не яв­ляющиеся цифрами.
Таким образом, вызов функции atoi() для числа 
123.23 возвратит целое зна­чение, а часть 0.23 будет опущена.
*/

int	ispace(char space)
{
	if (space == ' ' || space == '\t' || space == '\r'
		|| space == '\v' || space == '\n' || space == '\f')
		return (1);
	return (0);
}

int	ft_atoi(const char *str)
{
	int	i;
	int	negative;
	int	result;

	i = 0;
	negative = 1;
	result = 0;
	while (ispace(str[i]))
		i++;
	if (str[i] == '-')
	{
		negative = -1;
		i++;
	}
	else if (str[i] == '+')
		i++;
	while ((str[i] >= '0' && str[i] <= '9'))
		result = 10 * result + (str[i++] - '0');
	return (result * negative);
}
