/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 11:52:36 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 11:52:38 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Макрос isalnum() возвращает ненулевое значение, если его аргумент
является либо буквой ал­фавита (верхнего или нижнего регистра),
либо цифрой. Если символ не является буквенно-циф­ровым, возвращается 0.
*/

int	ft_isalnum(int a)
{
	if ((a >= '0' && a <= '9') || (a >= 'a' && a <= 'z')
		|| (a >= 'A' && a <= 'Z'))
		return (1);
	return (0);
}
