/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 11:56:20 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 11:56:22 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Макрос isprint() возвращает ненулевое значение,
если аргумент ch является печатным символом, включая пробел;
в противном случае возвращается 0.
Значения печатных символов находятся в пределах от 0x20 до 0х7Е.
*/

int	ft_isprint(int a)
{
	if (a >= 0x20 && a <= 0x7E)
		return (1);
	return (0);
}
