/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 12:02:07 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 12:02:09 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Функция memcpy копирует count байт из массива (области памяти),
на который указывает аргумент source, в массив (область памяти),
на который указывает аргумент dest. Если массивы перекрываются,
результат копирования будет не определен.
*/

void	*ft_memcpy(void *dest, const void *source, size_t count)
{
	size_t	i;

	i = 0;
	if (dest == NULL && source == NULL)
		return (NULL);
	while (i < count)
	{
		*(char *)(dest + i) = *(char *)(source + i);
		i++;
	}
	return (dest);
}
