/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 12:46:40 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 12:46:42 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Выводит символ c в указанный файл
дескриптор.
*/

void	ft_putchar_fd(char c, int fd)
{
	write (fd, &c, 1);
}
