/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aafrikya <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/18 12:09:07 by aafrikya          #+#    #+#             */
/*   Updated: 2023/01/18 12:09:09 by aafrikya         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Только функция toupper() определена стандартом ANSI С.
Функция toupper() возвращает соответствующий верхнему
регистру эквивалент символа ch, если ch — это буква.
В противном случае ch возвращается неизмененным.
*/

int	ft_toupper(int ch)
{
	if (ch >= 'a' && ch <= 'z')
		return (ch -= 32);
	return (ch);
}
